/* strformat.h
 *  
 * Filename: strformat.h 
 * Description: 字符串操作头文件 
 * Author: hnlyyk 
 * Maintainer:  
 * Created: 一  8月 20 22:57:19 2012 (+0800) 
 * Version:  
 * Compatibility:  
 *  
 */  
/* Commentary:  
 * 为的是体验Cunit而临时写的几项功能函数，没有多大实际意义，仅仅是为了写测试类 
 *  
 *  
 */  
  
/* Change Log: 
 *  
 *  
 */  
  
/* Code: */  
  
#ifndef _strformat_h  
#define _strformat_h  
  
typedef char * string;  
  
/************************************************************************* 
*功能描述：返回字符串的长度 
*参数列表： 
*返回类型： 
**************************************************************************/
int string_lenth(string word);

/************************************************************************* 
*功能描述：返回字符串的大写形式 
*参数列表： 
*返回类型： 
**************************************************************************/
string to_Upper(string word);  

/************************************************************************* 
*功能描述：连接字符串 
*参数列表： 
*返回类型： 
**************************************************************************/  
string add_str(string word1 ,string word2);  
  
  
  
#endif  
  
  
/* strformat.h ends here */  